#+TITLE: FENIAX architecture
#+AUTHOR: Alvaro Cea
#+Date: 11/29/2024
#+STARTUP: inlineimages
#+LATEX_HEADER: \usepackage{algpseudocode}
#+LATEX_HEADER: \usepackage[ruled,vlined]{algorithm2e}

* System based solutions :noexport:
TODO: make automatic label as the first
| Type         | Target | Gravity    | BC1        | ModalAero | SteadyAero   | UnsteadyAero | Point loads | q0 approx | Rigid-body           | Nonlinearities         | residualised |
|--------------+--------+------------+------------+-----------+--------------+--------------+-------------+-----------+----------------------+------------------------+--------------|
| 1 static     | Level  | False: "g" | Clamped    | None      | None         | None         | None        | via q2    | 1-quaternion+strains | All -> ""              | None -> ""   |
| 2 Dynamic    | TRIM1  | True: "G"  | Free       | Rogers    | qalpha       | gust         | follower    | via q1    | All-quaternions      | Linear sys -> "l"      | True -> "r"  |
| 3 staticAD   |        |            |            |           |              |              |             |           |                      |                        |              |
| 4 dynamicAD  |        |            |            |           |              |              |             |           |                      |                        |              |
| 3 staticPL   | TRIM2  |            | Prescribed | Loewner   | qx (control) | controls     | dead        |           |                      | Linear sys+disp -> "L" |              |
| 3 dynamicPL  | TRIM2  |            | Prescribed | Loewner   | qx (control) | controls     | dead        |           |                      | Linear sys+disp -> "L" |              |
| 3 staticPLAD | TRIM2  |            | Prescribed | Loewner   | qx (control) | controls     | dead        |           |                      | Linear sys+disp -> "L" |              |
| 3   | TRIM2  |            | Prescribed | Loewner   | qx (control) | controls     | dead        |           |                      | Linear sys+disp -> "L" |              |

| 3 Stability | TRIM2  |            | Prescribed | Loewner   | qx (control) | controls     | dead        |           |                      | Linear sys+disp -> "L" |              |
| 4 Multibody |        |            |            |           |              |              |             |           |                      |                        |              |
| 5 Control   |        |            |            |           |              |              |             |           |                      |                        |              |

| Sol name |                                                 | label                 | Imp |
|----------+-------------------------------------------------+-----------------------+-----|
| 10G1     | Structural static under Gravity                 | [1,0,'G']             | Y   |
| 10g11    | Structural static with follower point forces    | [1,0,'g',0,0,0,0,1]   | Y   |
| 10g121   | Structural static with dead point forces        | [1,0,'g',0,0,0,0,2]   | Y   |
| 10g1331  | Structural static with follower+dead forces     | [1,0,'g',0,0,0,0,3]   | N   |
| 10g15    | Manoeuvre under qalpha                          | [1,0,'g',0,1,1]       | Y   |
| 10G15    | Manoeuvre under qalpha and Gravity              | [1,0,'G',0,1,1]       | N   |
| 10g75    | Manoeuvre under qalpha and controls             | [1,0,'g',0,1,2]       | N   |
| 10G75    | Manoeuvre under qalpha+controls+Gravity         | [1,0,'G',0,1,2]       | N   |
| 20g1     | Clamped Structural dynamics, free vibrations    | [2,0,'g']             | Y   |
| 20G2     | Free Structural dynamic with gravity forces     | [2,0,'G',1]           | Y   |
| 20g2     | Free Structural dynamic                         | [2,0,'g',1]           | Y   |
| 20g11    | Structural dynamic follower point forces        | [2,0,'g',0,0,0,0,1]   | Y   |
| 20g121   | Structural dynamic dead point forces            | [2,0,'g',0,0,0,0,2]   | Y   |
| 20g22    | Free Structural dynamic follower point forces   | [2,0,'g',1,0,0,0,1]   | Y   |
| 20g242   | Free Structural dynamic dead point forces       | [2,0,'g',1,0,0,0,2]   | Y   |
| 11G6     | Static trimmed State (elevator-qalpha,          | [1,1,'G',1,1]         | Y   |
|          | no gravity updating)                            |                       |     |
| 12G2     | Static trimmed State (elevator-qalpha,          | [1,2,'G',1]           | N   |
|          | gravity updating)                               |                       |     |
| 21G150   | Dynamic trimmed State                           | [2,1,'G',1,1,2]       | N   |
| 20g21    | Gust response                                   | [2,0,'g',0,1,0,1]     | Y   |
| 20g273   | Gust response, q0 obtained via integrator q1    | [2,0,'g',0,1,0,1,0,1] | Y   |
| 20g105   | Gust response with steady qalpha                | [2,0,'g',0,1,1,1]     | N   |
| 20g42    | Gust response Free-flight                       | [2,0,'g',1,1,0,1]     | N   |
| 20G42    | Gust response Free-flight and gravity (X error) | [2,0,'G',1,1,0,1]     | N   |
| 20G1050  | Gust response Free-flight, gravity, controls    | [2,0,'G',1,1,2,1]     | N   |
|          |                                                 |                       |     |

#+begin_src python :session py1 :results output
  import feniax.intrinsic.functions as functions
  label = functions.label_generator([2,0,'g',0,1,0,1,0,1])
  print(label)
#+end_src

#+RESULTS:
: 20g546[0m
: [0m


